nc: 2  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [11.361, 12.288, 15.308, 15.744, 19.187, 19.399]  # P4/16
  - [22.621, 22.893,
     28.074, 28.407, 123.56, 183.7 ]  # P5/32

backbone:
  # [from, number, module, args]
  [
    [-1, 1, GhostConv, [64, 3, 2]],  # 0-P1/2
    [-1, 1, GhostConv, [128, 3, 2]],  # 1-P2/4
    [-1, 3, C3Ghost, [128]],
    [-1, 1, GhostConv, [256, 3, 2]],  # 3-P3/8
    [-1, 6, C3Ghost, [256]],
    [-1, 1, GhostConv, [512, 3, 2]],  # 5-P4/16
    [-1, 9, C3Ghost, [512]],
    [-1, 1, GhostConv, [1024, 3, 2]],  # 7-P5/32
    [-1, 3, C3Ghost, [1024]],
    [-1, 1, SPPF, [1024, 5]],  # 9
  ]

head:
  [
    [-1, 1, GhostConv, [1024, 3, 1]],
    [-1, 1, GhostConv, [256, 1, 1]],
    [-1, 1, GhostConv, [512, 3, 1]],  # 12 (P5/32-large)

    [-2, 1, GhostConv, [128, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 6], 1, Concat, [1]],  # cat backbone P4
    [-1, 1, GhostConv, [256, 3, 1]],  # 16 (P4/16-medium)
    [ [16, 12], 1, Detect, [nc, anchors]],  # Detect(P4, P5)
  ]