# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 2  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [7.2999,11.866, 17.041, 24.596, 27.101,49.158]  # P3/8
  - [45.512,69.163, 69.685,109.676, 111.47,130.37]  # P4/16
  - [127.09,209.22, 210.77, 168.31, 209.43, 295.2]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [ [ -1, 1, GhostConv, [ 64, 3, 2 ] ],  # 0-P1/2
    [ -1, 1, GhostConv, [ 128, 3, 2 ] ],  # 1-P2/4
    [ -1, 3, C3DFCGhost, [ 128 ] ],
    [ -1, 1, GhostConv, [ 256, 3, 2 ] ],  # 3-P3/8
    [ -1, 6, C3DFCGhost, [ 256 ] ],
    [ -1, 1, GhostConv, [ 512, 3, 2 ] ],  # 5-P4/16
    [ -1, 9, C3DFCGhost, [ 512 ] ],
    [ -1, 1, GhostConv, [ 1024, 3, 2 ] ],  # 7-P5/32
    [ -1, 3, C3DFCGhost, [ 1024 ] ],
    [ -1, 1, SPPF, [ 1024, 5 ] ],  # 9
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, GhostConv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3Ghost, [512, False]],  # 13

   [-1, 1, GhostConv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3Ghost, [256, False]],  # 17 (P3/8-small)

   [-1, 1, GhostConv, [256, 3, 2]],
   [[-1, 14], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3Ghost, [512, False]],  # 20 (P4/16-medium)

   [-1, 1, GhostConv, [512, 3, 2]],
   [[-1, 10], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3Ghost, [1024, False]],  # 23 (P5/32-large)

   [[17, 20, 23], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
